import React, { Component } from 'react';

const styles = require('./styles.css');

class UserAgreement extends Component {

  render() {
    return (
      <div>
        <div className={styles.title}>用户协议</div>
        <div className={styles.detail}>
          <div>一、注册协议条款的确认和接受</div>
            启航龙图医学考试中心（以下简称荟医教育）考试APP（以下简称本APP）同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务（以下简称“网络服务”）。<br />
            为获得网络服务，申请人应当认真阅读、充分理解本《协议》中各条款，包括免除或者限制荟医教育题库APP的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》（未成年人应在法定监护人陪同下阅读）。<br />
            同意接受本西医的全部条款的，申请人应当按照页面上的提示完成全部的注册程序，并在注册程序过程中点击“同意”按钮，否则视为不接受本《协议》全部条款，申请人应当终止并退出申请。<br />
            本《协议》可由荟医教育定期更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP内查阅最新版协议条款。在荟医教育修改《协议》条款后，如果用户不接受修改后的条款，请立即停止使用本APP提供的网络服务，继续使用的用户将被视为已接受了修改后的协议。<br/>
            1、用户同意<br />
            1）．用户同意遵守《中华人民共和国保守国家秘密法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》等有关计算机及互联网规定的法律和法规、实施办法。在任何情况下，荟医教育合理地认为用户的行为可能违反上述法律、法规时，荟医教育可以在任何时候，不经事先通知终止向该用户提供服务。用户应了解国际互联网的无国界性，应特别注意遵守当地所有有关的法律和法规。<br />
            2）．服务条款的修改：荟医教育会不定时地修改服务条款，服务条款一旦发生变动，将以本网站最新条款为准。<br />
            3）．服务修订：荟医教育保留随时修改或中断服务而不需知照用户的权利。荟医教育行使修改或中断服务的权利，不需对用户或第三方负责。<br />
            4）．用户隐私制度：尊重用户个人隐私是荟医教育的基本政策。荟医教育不会公开、编辑或透露用户的注册信息，除非有法律许可要求，或荟医教育在诚信的基础上认为透露这些信息在以下三种情况是必要的：<br />
              ①遵守有关法律规定，遵从合法服务程序。<br />
              ②在紧急情况下竭力维护用户个人和社会大众的隐私安全。<br />
              ③符合其他相关的要求。<br />
            5）．用户的帐号、密码和安全性，一旦注册成功，成为荟医教育的用户，您将得到一个密码和帐号。如果您不保管好自己的帐号和密码安全，由此所造成的损失将由您自行承担。另外，每个用户都要对其帐户中的所有活动和事件负全责。您可随时根据指示改变您的密码，也可以结束旧的帐户重开一个新帐户。用户若发现任何非法使用用户帐号或安全漏洞的情况，应立即修改账号密码并妥善保管。因黑客行为或用户的保管疏忽导致账号非法使用，荟医教育不承担任何责任。<br />
            6）．如果用户账号中含有不雅文字或不恰当名称的，荟医教育保留注销其用户账号的权利。<br />
            7）．用户账号的多有权归会以及教育，用户完成申请注册手续后，用户享有使用权。3个月未使用得用户账号，荟医教育保留收回的权利。<br />
            8）．用户账号和密码仅由初始申请注册人使用，用户不得将自己用户账号或密码有偿或无偿以转让、出借、授权等方式提供给第三人操作和使用，否则用户应当自行承担因违反此要求而遭致的任何损失。违反本项约定的，荟医教育将保留收回账号的权利。若因违反本约定对他人造成损害的，用户应与实际使用人承担连带赔偿责任，同时荟医教育保留追究用户违约责任的权利。<br />
            9）．为了更好的提供个性化服务，改善用户的学习、练习效率和效果，在不透露单个用户隐私资料的前提下，荟医教育将收集用户的练习数据进行分析。这些练习数据可能会以排行榜的形式在APP内部进行展示。<br />
            10）．免责条款：用户明确同意网站服务的使用由用户个人承担风险。荟医教育不作任何类型的担保，不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保。用户理解并接受：任何通过荟医教育服务取得的信息资料的可靠性取决于用户自己，用户自己承担所有风险和责任。<br />
            11）．有限责任：荟医教育对任何直接、间接、偶然、特殊及继起的损害不负责任。<br />
            12）．不提供零售和商业性服务，用户使用网站服务的权利是个人的。用户只能是一个单独的个体而不能是一个公司或实体商业性组织。用户承诺不经荟医教育同意，不能利用网站服务进行销售或其他商业用途。<br />
            13）．用户在使用APP过程中单独承担传输内容的责任。用户必须遵循：<br />
              ①从中国境内向外传输技术性资料时必须符合中国有关法规。<br />
              ②使用网站服务不作非法用途。<br />
              ③不干扰或混乱网络服务。<br />
              ④不在论坛BBS或留言簿发表任何与政治相关的信息。<br />
              ⑤遵守所有使用网站服务的网络协议、规定、程序和惯例。<br />
              ⑥不得利用本站危害国家安全、泄露国家秘密，不得侵犯国家社会集体的和公民的合法权益。<br />
              ⑦不得利用本站制作、复制和传播下列信息：<br />
                a.煽动抗拒、破坏宪法和法律、行政法规实施的；<br />
                b.煽动颠覆国家政权，推翻社会主义制度的；<br />
                c.煽动分裂国家、破坏国家统一的；<br />
                d.煽动民族仇恨、民族歧视，破坏民族团结的；<br />
                e.捏造或者歪曲事实，散布谣言，扰乱社会秩序的；<br />
                f.宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；<br />
                g.公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；<br />
                h.损害国家机关信誉的；<br />
                j.其他违反宪法和法律行政法规的；<br />
                k.本软件是商业行为。用户不能传输任何教唆他人构成犯罪行为的资料；不能传输对国内不利条件和涉及国家安全的资料；不能传输任何不符合当地法规、国家法律和国际法律的资料。未经许可而非法进入其它电脑系统是禁止的。若用户的行为不符合以上的条款，荟医教育将取消用户服务帐号。
          <div>二、版权声明</div>
            荟医教育提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其他财产所有权法律的保护，未经相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。所有以上资料或资料的任何部分仅可作为私人和非商业用途保存。荟医教育不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生的任何损害赔偿，以任何形式，向用户或任何第三方负责。
          <div>三、协议的用途、更新和效力</div>
          1、本协议之服务条款用以规范用户使用荟医教育APP提供的服务。<br />
          2、鉴于国家法律法规不时变化及荟医教育运营之需要，荟医教育有权对本协议条款不时地进行修改，修改后的协议一旦被公布于荟医教育APP上即告生效，并替代原来的协议。用户有义务不时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议，则应立即停止接受荟医教育依据本协议提供的服务；若用户继续使用荟医教育提供的服务的，即视为同意更新后的协议。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。<br />
          <div>四、解释权：本注册协议的解释权归荟医教育所有。如果其中有任何条款与国家的有关法律相抵触，则以国家法律的明文规定为准。</div>

        </div>
      </div>
    );
  }
}

export default UserAgreement;
